Revit 2027 API
RevitAPISingleEventArgs Class
 The class is used as a base class for arguments of any single-event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 More
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RevitAPISingleEventArgs : RevitAPIEventArgs
Public Class RevitAPISingleEventArgs
	Inherits RevitAPIEventArgs
public ref class RevitAPISingleEventArgs : public RevitAPIEventArgs
type RevitAPISingleEventArgs =
    class
        inherit RevitAPIEventArgs
    end
The RevitAPISingleEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Top
Methods
Name | Description
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 A single event is an event that is not directly related to another event, meaning that there is no corresponding pre-event or post-event surrounding a single event.
See Also
Reference
Autodesk.Revit.DB.Events Namespace
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.ApplicationInitializedEventArgs
 Autodesk.Revit.DB.Events.DocumentChangedEventArgs
 Autodesk.Revit.DB.Events.DocumentWorksharingEnabledEventArgs
 Autodesk.Revit.DB.Events.FailuresProcessingEventArgs
 Autodesk.Revit.DB.Events.ProgressChangedEventArgs
 Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs
 Autodesk.Revit.UI.Events.DockableFrameFocusChangedEventArgs
 Autodesk.Revit.UI.Events.DockableFrameVisibilityChangedEventArgs
 Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs
 Autodesk.Revit.UI.Events.MacroUpdatedEventArgs
 Autodesk.Revit.UI.Events.SelectionChangedEventArgs
 Autodesk.Revit.UI.Events.ThemeChangedEventArgs
 Autodesk.Revit.UI.Events.TransferredProjectStandardsEventArgs